Revit 2026 API

# DuctSetSystemType Method

---

Updates the associated system type for the duct.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSystemType(
	ElementId systemTypeId
)
```
```vb
Public Sub SetSystemType (
	systemTypeId As ElementId
)
```
```cpp
public:
void SetSystemType(
	ElementId^ systemTypeId
)
```
```fsharp
member SetSystemType :
        systemTypeId : ElementId -> unit
```

#### Parameters

systemTypeId ElementId
     The ElementId of the hvac system type.

| Exception | Condition |
| --- | --- |
| ArgumentException | The systemTypeId is not valid HVAC system type. |
| ArgumentNullException | A non-optional argument was null |

If the duct previously did not have a system associated to it, this will create a new system.

#### Reference

Duct Class

Autodesk.Revit.DB.Mechanical Namespace